<template>
  <div>
    <table v-if="one">
      <tr>
        <th>대출대상</th>
        <td>
          <span class="highlight">
            대출 신청일 현재 최근 1년이내 3개월이상 재직·소득
            확인시(농·축·임·어업인 추가)이 가능한 만19세 이상 근로자 다만,
            근로소득자는 현 직장 1개월이상 근로 및 급여수령 필수 </span
          ><br />
          연소득 3,500만원 이하 <br />연소득 3,500만원 초과 ~ 연소득 4,500만원
          이하<br />
          :현재 1개 이상의 「신용정보의 이용 및 보호에 관한 법률(이하
          ‘신용정보법’)」 제2조제5호가목에 따른
          개인신용평가회사(「신용정보법」제5조제1항에 따른 전문개인신용평가업을
          영위하는 회사는 제외한다. 이와 같다.)가 산정한 개인신용평점이 하위
          100분의 20에 해당되는 자 <br />나이스 신용평점 355점 이상
          <br />제외대상 : 부도, 금융채무 불이행자, 파산절차 진행중인 자,
          개인회생 및 보증사고 관련자 등 연소득 4,500만원 초과 근로자
        </td>
      </tr>
      <tr>
        <th>대출한도</th>
        <td>
          최소 600만원 ~
          <span class="highlight">최대 2,000만원(개인신용평점별 차등)</span>
        </td>
      </tr>
      <tr>
        <th>대출기간</th>
        <td>3년 또는 5년 중 택일 가능</td>
      </tr>
      <tr>
        <th>대출금리</th>
        <td>
          최저 연 8.69% ~ 최고 연 10.29%(2022.03.01기준)(개인신용평점별 차등)<br />
          대출금리 = 기준금리 + 가산금리 (12개월 변동금리) <br />기준금리 :
          당행의 수신금리 및 예금보험료 등 조달관련 비용을 기초로 산정
          <br />가산금리 : 고객신용평점 등에 따라 달리 적용 <br />비대면(온라인)
          햇살론 진행시 1.3% 인하
        </td>
      </tr>
      <tr>
        <th>우대금리</th>
        <td>0.2% 인하</td>
      </tr>
      <tr>
        <th>우대금리 대상자</th>
        <td>
          <span class="highlight"
            >만 34세 이하 저소득(3,500만원 이하) 근로자</span
          >
        </td>
      </tr>
      <tr>
        <th>이자부과시기</th>
        <td>매월 후취(대출실행 응당일)</td>
      </tr>
      <tr>
        <th>상환방법</th>
        <td>원금균등분할상환</td>
      </tr>
      <tr>
        <th>연체이자율</th>
        <td>대출약정금리 + 3.0%(최대 연 13.29% 이내)</td>
      </tr>
      <tr>
        <th>부대비용</th>
        <td>
          보증수수료 : 연 2%(일시납/분할납 선택, 단 사회적배려대상자의 경우 연
          1%) <br /><span class="highlight"
            >보증료 우대 대상 : <br />1) 저소득 청년(만 34세 이하 연소득
            3,500만원 이하)의 경우 1.5% <br />2) 근로장려수급자자활근로자의 경우
            연 1.0% </span
          ><br />인지대 : 해당사항없음(5,000만원 이하) <br />취급수수료 :
          해당사항없음
        </td>
      </tr>
      <tr>
        <th>중도상환수수료</th>
        <td>해당사항없음</td>
      </tr>
      <tr>
        <th>금리인하요구권</th>
        <td>
          대출실행일 이후 신용등급 또는 개인신용평점 상승으로 상환능력이 변동된
          경우 금리인하를 요구할 수 있습니다.(단, 평가결과에 따라 금리인하가
          거절 될 수 있습니다)
        </td>
      </tr>
      <tr>
        <th>청약철회권</th>
        <td>
          대출실행일로부터 14일 이내(기간의 말일이 휴일인 경우 다음 영업일까지)
          대출계약에 대한 청약을 철회할 수 있습니다.(단, 이미 공급받은 금전,
          재화와 그에 대한 이자 및 수수료는 반환하여야 합니다)
        </td>
      </tr>
      <tr>
        <th>위법계약해지권</th>
        <td>
          「금융소비자 보호에 관한 법률」에서 정하는 적합성원칙, 적정성원칙 및
          설명의무를 위반하였거나, 불공정 영업행위 혹은 부당권유행위를 하여
          대출계약을 체결한 경우, '법 위반 사실을 안 날'부터 1년
          (계약체결일로부터 5년 이내의 범위에 있어야 함) 이내에 해당 계약의
          해지를 요구할 수 있습니다.
        </td>
      </tr>
      <tr>
        <th>자료열람요구권</th>
        <td>
          금융소비자는 「금융소비자보호에 관한 법률」 제36조에 따른 분쟁조정
          또는 소송 등 권리구제를 위한 목적으로 저축은행에 자료의 열람을 요구할
          수 있습니다.
        </td>
      </tr>
      <tr>
        <th>유의사항</th>
        <td>
          계약 체결 전 상품설명서 및 약관을 확인하시기 바랍니다. <br />해당
          상품에 대해 충분한 사전 설명을 받을 권리가 있으며, 설명을 이해한 후
          거래하시기 바랍니다. <br />대출 심사 시 내용에 따라 추가 서류를 요청할
          수 있습니다. <br />저축은행의 심사기준과 고객 신용도에 따라 대출여부가
          결정되며, 금리 및 한도가 달라질 수 있습니다. <br />고객 신용도에 따라
          대출금리가 차등적용되며, 대출취급이 제한될 수 있습니다. <br />대출상품
          이용 시 귀하의 개인신용평점이 하락될 수 있습니다. <br />개인신용평점
          하락으로 금융거래의 제약 또는 불이익이 발생할 수 있습니다.
          <br />과도한 대출은 개인신용평점 하락의 원인이 될 수 있습니다.
          <br />대출이자 또는 원금 연체시 신용상에 불이익을 받으실 수 있습니다.
          <br />연체 시 계약기간 만료 전 원리금 변제의무가 발생할 수 있습니다.
          <br />자세한 사항은 홈페이지(www.hanasavings.com)를 참조하시거나
          손님케어센터(1600-9888)로 문의하시기 바랍니다. <br />위 내용은
          하나저축은행 홈페이지(www.hanasavings.com)상품공시실 내용과
          동일합니다.
        </td>
      </tr>
    </table>
    <table v-if="two">
      <tr>
        <th>대출대상</th>
        <td>
          급여소득자 : 보증신청일 현재 5개월 이상 재직자로서 연소득 1,200만원
          이상인 자(만 19세 이상) <br />사업소득자 : 보증신청일 현재 4개월 이상
          사업소득 발생자로서 연소득 600만원 이상인 자(만 19세 이상)
          <br />연금소득자 : 보증신청일 현재 연금소득 1회 이상 수령자로서
          연금소득 연 600만원 이상인 자(만 19세 이상) <br />나이스 신용평점
          355점 이상 <br />제외대상 : 부도, 금융채무 불이행자, 파산절차 진행중인
          자, 개인회생 및 보증사고 관련자 등
        </td>
      </tr>
      <tr>
        <th>대출한도</th>
        <td>
          최소 100 만원 - 최대 3,000 만원 (단, 서울보증보험 승인금액 이내)
        </td>
      </tr>
      <tr>
        <th>대출기간</th>
        <td>1년 - 5년(대출기간은 년 단위로 취급 가능)</td>
      </tr>
      <tr>
        <th>대출금리</th>
        <td>
          최저 연 10.5% - 최고 연 19.49%(개인신용평점별 차등) <br />대출금리 =
          기준금리+가산금리(3개월 변동금리) <br />기준금리 : 당행의 수신금리 및
          예금보험료 등 조달관련 비용을 기초로 산정 <br />가산금리 :
          고객신용평점 등에 따라 달리 적용
        </td>
      </tr>
      <tr>
        <th>이자부과시기</th>
        <td>매월 후취(대출실행 응당일)</td>
      </tr>
      <tr>
        <th>상환방법</th>
        <td>원금균등분할상환</td>
      </tr>
      <tr>
        <th>연체이자율</th>
        <td>대출약정금리 + 3.0%(최대 연 19.99% 이내)</td>
      </tr>
      <tr>
        <th>부대비용</th>
        <td>
          보증수수료 : 해당사항없음 <br />인지대 : 해당사항없음(5,000만원
          이하)<br />
          취급수수료 : 해당사항없음
        </td>
      </tr>
      <tr>
        <th>중도상환수수료</th>
        <td>해당사항없음</td>
      </tr>
      <tr>
        <th>금리인하요구권</th>
        <td>
          대출실행일 이후 신용등급 또는 개인신용평점 상승으로 상환능력이 변동된
          경우 금리인하를 요구할 수 있습니다.(단, 평가결과에 따라 금리인하가
          거절 될 수 있습니다)
        </td>
      </tr>
      <tr>
        <th>청약철회권</th>
        <td>
          대출실행일로부터 14일 이내(기간의 말일이 휴일인 경우 다음 영업일까지)
          대출계약에 대한 청약을 철회할 수 있습니다.(단, 이미 공급받은 금전,
          재화와 그에 대한 이자 및 수수료는 반환하여야 합니다)
        </td>
      </tr>
      <tr>
        <th>위법계약해지권</th>
        <td>
          「금융소비자 보호에 관한 법률」에서 정하는 적합성원칙, 적정성원칙 및
          설명의무를 위반하였거 나, 불공정 영업행위 혹은 부당권유행위를 하여
          대출계약을 체결한 경우, '법 위반 사실을 안 날'부터 1년 1
          (계약체결일로부터 5년 이내의 범위에 있어야 함) 이내에 해당 계약의
          해지를 요구할 수 있습니다.
        </td>
      </tr>
      <tr>
        <th>자료열람요구권</th>
        <td>
          금융소비자는 「금융소비자보호에 관한 법률」 제36조에 따른 분쟁조정
          또는 소송 등 권리구제를 위한 목적으로 저축은행에 자료의 열람을 요구할
          수 있습니다.
        </td>
      </tr>
      <tr>
        <th>유의사항</th>
        <td>
          계약 체결 전 상품설명서 및 약관을 확인하시기 바랍니다. <br />해당
          상품에 대해 충분한 사전 설명을 받을 권리가 있으며, 설명을 이해한 후
          거래하시기 바랍니다. <br />대출 심사 시 내용에 따라 추가 서류를 요청할
          수 있습니다. <br />저축은행의 심사기준과 고객 신용도에 따라 대출여부가
          결정되며, 금리 및 한도가 달라질 수 있습니다. <br />고객 신용도에 따라
          대출금리가 차등적용되며, 대출취급이 제한될 수 있습니다. <br />대출상품
          이용 시 귀하의 개인신용평점이 하락될 수 있습니다. <br />개인신용평점
          하락으로 금융거래의 제약 또는 불이익이 발생할 수 있습니다.
          <br />과도한 대출은 개인신용평점 하락의 원인이 될 수 있습니다.
          <br />대출이자 또는 원금 연체시 신용상에 불이익을 받으실 수 있습니다.
          <br />연체 시 계약기간 만료 전 원리금 변제의무가 발생할 수 있습니다.
          <br />자세한 사항은 홈페이지(www.hanasavings.com)를 참조하시거나
          손님케어센터(1600-9888)로 문의하시기 바랍니다. <br />위 내용은
          하나저축은행 홈페이지(www.hanasavings.com)상품공시실 내용과
          동일합니다.
        </td>
      </tr>
    </table>
    <table v-if="three">
      <tr>
        <th>대출대상</th>
        <td>
          대출 신청일 현재 동일직장 3개월 이상 재직 중인 만 23세 이상인 근로자로
          연소득 1,200만원 이상인 자 <br />나이스 신용평점 355점 이상
          <br />제외대상 : 부도, 금융채무 불이행자, 파산절차 진행중인 자,
          개인회생 및 보증사고 관련자 등
        </td>
      </tr>
      <tr>
        <th>대출한도</th>
        <td>최소 300만원 ~ 최대 5,000만원</td>
      </tr>
      <tr>
        <th>대출기간</th>
        <td>1년 - 6년(대출기간은 년 단위로 취급 가능)</td>
      </tr>
      <tr>
        <th>대출금리</th>
        <td>
          적용금리 : 최저 연 5.9% - 최고 연 19.49%(개인신용평점별 차등)
          <br />대출금리 = 기준금리 + 가산금리 (12개월 변동금리) <br />기준금리:
          당행의 수신금리 및 예금보험료 등 조달관련 비용을 기초로 산정
          <br />가산금리: 고객신용평점 등에 따라 달리 적용
        </td>
      </tr>
      <tr>
        <th>이자부과시기</th>
        <td>매월 후취(대출실행 응당일)</td>
      </tr>
      <tr>
        <th>상환방법</th>
        <td>원리금균등분할상환</td>
      </tr>
      <tr>
        <th>연체이자율</th>
        <td>대출약정금리 + 3.0%(최대 연 19.99% 이내)</td>
      </tr>
      <tr>
        <th>부대비용</th>
        <td>
          보증수수료 : 해당사항없음 <br />인지대 : 해당사항없음(5천만원 이하)<br />
          취급수수료 : 해당사항없음
        </td>
      </tr>
      <tr>
        <th>중도상환수수료</th>
        <td>
          기한전상환대출금액 X 1% X 대출잔여일수/대출기간(3년이내 상환시 적용)
        </td>
      </tr>
      <tr>
        <th>금리인하요구권</th>
        <td>
          대출실행일 이후 신용등급 또는 개인신용평점 상승으로 상환능력이 변동된
          경우 금리인하를 요구 할 수 있습니다.(단, 평가결과에 따라 금리인하가
          거절 될 수 있습니다)
        </td>
      </tr>
      <tr>
        <th>청약철회권</th>
        <td>
          대출실행일로부터 14일 이내(기간의 말일이 휴일인 경우 다음 영업일까지)
          대출계약에 대한 청약을 철회할 수 있습니다.(단, 이미 공급받은 금전,
          재화와 그에 대한 이자 및 수수료는 반환하여야 합니다)
        </td>
      </tr>
      <tr>
        <th>위법계약해지권</th>
        <td>
          「금융소비자 보호에 관한 법률」에서 정하는 적합성원칙, 적정성원칙 및
          설명의무를 위반하였거나, 불공정영업행위 혹은 부당권유행위를 하여
          대출계약을 체결한 경우, '법 위반 사실을 안 날'부터 1년
          (계약체결일로부터 5년 이내의 범위에 있어야 함) 이내에 해당 계약의
          해지를 요구할 수 있습니다.
        </td>
      </tr>
      <tr>
        <th>자료열람요구권</th>
        <td>
          금융소비자는 「금융소비자보호에 관한 법률」 제36조에 따른 분쟁조정
          또는 소송 등 권리구제를 위한 목적으로 저축은행에 자료의 열람을 요구할
          수 있습니다.
        </td>
      </tr>
      <tr>
        <th>유의사항</th>
        <td>
          계약 체결 전 상품설명서 및 약관을 확인하시기 바랍니다. <br />해당
          상품에 대해 충분한 사전 설명을 받을 권리가 있으며, 설명을 이해한 후
          거래하시기 바랍니다. <br />대출 심사 시 내용에 따라 추가 서류를 요청할
          수 있습니다. <br />저축은행의 심사기준과 고객 신용도에 따라 대출여부가
          결정되며, 금리 및 한도가 달라질 수 있습니다. <br />고객 신용도에 따라
          대출금리가 차등적용되며, 대출취급이 제한될 수 있습니다. <br />대출상품
          이용 시 귀하의 개인신용평점이 하락될 수 있습니다. <br />개인신용평점
          하락으로 금융거래의 제약 또는 불이익이 발생할 수 있습니다.
          <br />과도한 대출은 개인신용평점 하락의 원인이 될 수 있습니다.
          <br />대출이자 또는 원금 연체시 신용상에 불이익을 받으실 수 있습니다.
          <br />연체 시 계약기간 만료 전 원리금 변제의무가 발생할 수 있습니다.
          <br />자세한 사항은 홈페이지(www.hanasavings.com)를 참조하시거나
          손님케어센터(1600-9888)로 문의하시기 바랍니다. <br />위 내용은
          하나저축은행 홈페이지(www.hanasavings.com)상품공시실 내용과
          동일합니다.
        </td>
      </tr>
    </table>
    <table v-if="four">
      <tr>
        <th>대출대상</th>
        <td>
          대출 신청일 현재 동일직장 3개월 이상 재직 중인 만 27세 이상인 근로자로
          연소득 3,500만원 이상인 자 <br />나이스 신용평점 650점 이상
          <br />제외대상 : 부도, 금융채무 불이행자, 파산절차 진행중인 자,
          개인회생 및 보증사고 관련자 등
        </td>
      </tr>
      <tr>
        <th>대출한도</th>
        <td>최소 300만원 ~ 최대 1억원</td>
      </tr>
      <tr>
        <th>대출기간</th>
        <td>1년 ~ 10년(대출기간은 년 단위로 취급가능)</td>
      </tr>
      <tr>
        <th>대출금리</th>
        <td>
          적용금리 : 최저 연 5.9% ~ 최고 연 17.99%(개인신용평점별 차등)
          <br />대출금리 = 기준금리 + 가산금리 (12개월 변동금리) <br />기준금리:
          당행의 수신금리 및 예금보험료 등 조달관련 비용을 기초로 산정
          <br />가산금리: 고객신용평점 등에 따라 달리 적용
        </td>
      </tr>
      <tr>
        <th>이자부과시기</th>
        <td>매월 후취(대출실행 응당일)</td>
      </tr>
      <tr>
        <th>상환방법</th>
        <td>원리금균등분할상환 / 만기일시상환 중 택일</td>
      </tr>
      <tr>
        <th>연체이자율</th>
        <td>대출약정금리 + 3.0%(최대 연 19.99% 이내)</td>
      </tr>
      <tr>
        <th>부대비용</th>
        <td>
          보증수수료 : 해당사항없음 <br />인지대 : 대출금 5,000만원 초과시
          인지세 발생(대출금 5,000만원 이하 인지세 부담 없음) <br />※ 대출금
          5,000만원 초과 ~ 1억원 이하 인지세 : 7만원(은행/손님 50%씩 부담)
          <br />취급수수료 : 해당사항없음
        </td>
      </tr>
      <tr>
        <th>중도상환수수료</th>
        <td>
          기한전상환대출금액 X 1% X 대출잔여일수/대출기간(3년이내 상환시 적용)
        </td>
      </tr>
      <tr>
        <th>금리인하요구권</th>
        <td>
          대출실행일 이후 신용등급 또는 개인신용평점 상승으로 상환능력이 변동된
          경우 금리인하를 요구할 수 있습니다.(단, 평가결과에 따라 금리인하가
          거절 될 수 있습니다)
        </td>
      </tr>
      <tr>
        <th>청약철회권</th>
        <td>
          대출실행일로부터 14일 이내(기간의 말일이 휴일인 경우 다음 영업일까지)
          대출계약에 대한 청약을 철회할 수 있습니다.(단, 이미 공급받은 금전,
          재화와 그에 대한 이자 및 수수료는 반환하여야 합니다)
        </td>
      </tr>
      <tr>
        <th>위법계약해지권</th>
        <td>
          「금융소비자 보호에 관한 법률」에서 정하는 적합성원칙, 적정성원칙 및
          설명의무를 위반하였거나, 불공정영업행위 혹은 부당권유행위를 하여
          대출계약을 체결한 경우,＇법 위반 사실을 안 날＇부터 1년
          (계약체결일로부터 5년 이내의 범위에 있어야 함) 이내에 해당 계약의
          해지를 요구할 수 있습니다.
        </td>
      </tr>
      <tr>
        <th>자료열람요구권</th>
        <td>
          금융소비자는 「금융소비자보호에 관한 법률」 제36조에 따른 분쟁조정
          또는 소송 등 권리구제를 위한 목적으로 저축은행에 자료의 열람을 요구할
          수 있습니다.
        </td>
      </tr>
      <tr>
        <th>유의사항</th>
        <td>
          계약 체결 전 상품설명서 및 약관을 확인하시기 바랍니다. <br />해당
          상품에 대해 충분한 사전 설명을 받을 권리가 있으며, 설명을 이해한 후
          거래하시기 바랍니다. <br />대출 심사 시 내용에 따라 추가 서류를 요청할
          수 있습니다. <br />저축은행의 심사기준과 고객 신용도에 따라 대출여부가
          결정되며, 금리 및 한도가 달라질 수 있습니다. <br />고객 신용도에 따라
          대출금리가 차등적용되며, 대출취급이 제한될 수 있습니다. <br />대출상품
          이용 시 귀하의 개인신용평점이 하락될 수 있습니다. <br />개인신용평점
          하락으로 금융거래의 제약 또는 불이익이 발생할 수 있습니다.
          <br />과도한 대출은 개인신용평점 하락의 원인이 될 수 있습니다.
          <br />대출이자 또는 원금 연체시 신용상에 불이익을 받으실 수 있습니다.
          <br />연체 시 계약기간 만료 전 원리금 변제의무가 발생할 수 있습니다.
          <br />자세한 사항은 홈페이지(www.hanasavings.com)를 참조하시거나
          손님케어센터(1600-9888)로 문의하시기 바랍니다. <br />위 내용은
          하나저축은행 홈페이지(www.hanasavings.com)상품공시실 내용과
          동일합니다.
        </td>
      </tr>
    </table>
  </div>
</template>

<script>
export default {
  name: "Detail",
  props: {
    one: { type: Boolean, default: false },
    two: { type: Boolean, default: false },
    three: { type: Boolean, default: false },
    four: { type: Boolean, default: false },
  },
};
</script>

<style lang="scss" scoped>
table {
  border-collapse: separate;
  border-spacing: 0 1rem;
  font-size: 1.2rem;
  tr {
    vertical-align: text-top;
    th {
      width: 20%;
    }
    td {
      width: 80%;
      .highlight {
        color: blue;
      }
    }
  }
}
</style>
